9/data/attachments/29ba5e9edd7bbdc4.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_e14a244b-93c0-48b8-8d81-c113e96e4042</nif:username>
            <nif:friendToBeAdded>Ronald_system_Friend_36883_1</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>